# GetParameterDefaultValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..GetParameterDefaultValue Method
RebarShapeDefinition Class See Also
---
Return the parameter's default value as stored in the definition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public double GetParameterDefaultValue(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Function GetParameterDefaultValue ( _
	paramId As ElementId _
) As Double
```

Visual C++
---
```text
public:
double GetParameterDefaultValue(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Id of a parameter in the definition.
# ### Return Value
The parameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This RebarShapeDefinition does not have a value for the parameter paramId. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace